jonacappelle/nRF52-BLE-IMU/ble_services/ble_motion_service.c
/*  ____  ____      _    __  __  ____ ___
 * |  _ \|  _ \    / \  |  \/  |/ ___/ _ \
 * | | | | |_) |  / _ \ | |\/| | |  | | | |
 * | |_| |  _ <  / ___ \| |  | | |__| |_| |
 * |____/|_| \_\/_/   \_\_|  |_|\____\___/
 *                           research group
 *                             dramco.be/
 *
 *  KU Leuven - Technology Campus Gent,
 *  Gebroeders De Smetstraat 1,
 *  B-9000 Gent, Belgium
 *
 *         File: ble_motion_service.c
 *      Created: 2022-03-01
 *       Author: Jona Cappelle
 *      Version: 1.0
 *
 *  Description: Bluetooth Low Energy - Services and Characteristics Description
 *
 *  Commissiond by Interreg NOMADe
 *
 */

#include "ble_motion_service.h"
#include "ble_srv_common.h"
#include "sdk_common.h"

#include "nrf_log.h"
#include "nrf_log_ctrl.h"
#include "nrf_log_default_backends.h"


#define BLE_UUID_TMS_CONFIG_CHAR      0x0401                      /**< The UUID of the config Characteristic. */
#define BLE_UUID_TMS_ADC_CHAR         0x0402                      /**< The UUID of the adc Characteristic. */
#define BLE_UUID_TMS_QUATERNION_CHAR  0x0403                      /**< The UUID of the quaternion Characteristic. */
#define BLE_UUID_TMS_RAW_CHAR         0x0404                      /**< The UUID of the raw data Characteristic. */
#define BLE_UUID_TMS_EULER_CHAR       0x0405                      /**< The UUID of the euler Characteristic. */
#define BLE_UUID_TMS_INFO_CHAR        0x0406                      /**< The UUID of the info Characteristic. */

// EF68xxxx-9B35-4933-9B10-52FFA9740042
// #define TMS_BASE_UUID                  {{0x42, 0x00, 0x74, 0xA9, 0xFF, 0x52, 0x10, 0x9B, 0x33, 0x49, 0x35, 0x9B, 0x00, 0x00, 0x68, 0xEF}} /**< Used vendor specific UUID. */
#define TMS_BASE_UUID                  {{0x5d, 0x82, 0x7d, 0x69, 0x83, 0xd1, 0x7c, 0x96, 0x2e, 0x43, 0xfb, 0x95, 0x54, 0x03, 0xaa, 0xcb}}


/**@brief Function for handling the @ref BLE_GAP_EVT_CONNECTED event from the S132 SoftDevice.
 *
 * @param[in] p_tms     Motion Service structure.
 * @param[in] p_ble_evt Pointer to the event received from BLE stack.
 */
static void on_connect(ble_tms_t * p_tms, ble_evt_t * p_ble_evt)
{
    p_tms->conn_handle = p_ble_evt->evt.gap_evt.conn_handle;
}


/**@brief Function for handling the @ref BLE_GAP_EVT_DISCONNECTED event from the S132 SoftDevice.
 *
 * @param[in] p_tms     Motion Service structure.
 * @param[in] p_ble_evt Pointer to the event received from BLE stack.
 */
static void on_disconnect(ble_tms_t * p_tms, ble_evt_t * p_ble_evt)
{
    UNUSED_PARAMETER(p_ble_evt);
    p_tms->conn_handle = BLE_CONN_HANDLE_INVALID;
}


/**@brief Function for handling the @ref BLE_GATTS_EVT_WRITE event from the S132 SoftDevice.
 *
 * @param[in] p_tms     Motion Service structure.
 * @param[in] p_ble_evt Pointer to the event received from BLE stack.
 */
static void on_write(ble_tms_t * p_tms, ble_evt_t * p_ble_evt)
{
    ble_gatts_evt_write_t * p_evt_write = &p_ble_evt->evt.gatts_evt.params.write;

    if ( (p_evt_write->handle == p_tms->adc_handles.cccd_handle) &&
         (p_evt_write->len == 2) )
    {
        bool notif_enabled;

        notif_enabled = ble_srv_is_notification_enabled(p_evt_write->data);

        if (p_tms->is_adc_notif_enabled != notif_enabled)
        {
            p_tms->is_adc_notif_enabled = notif_enabled;

            if (p_tms->evt_handler != NULL)
            {
                p_tms->evt_handler(p_tms, BLE_TMS_EVT_NOTIF_ADC, p_evt_write->data, p_evt_write->len);
            }
        }
    }
    else if ( (p_evt_write->handle == p_tms->quat_handles.cccd_handle) &&
         (p_evt_write->len == 2) )
    {
        bool notif_enabled;

        notif_enabled = ble_srv_is_notification_enabled(p_evt_write->data);

        if (p_tms->is_quat_notif_enabled != notif_enabled)
        {
            p_tms->is_quat_notif_enabled = notif_enabled;

            if (p_tms->evt_handler != NULL)
            {
                p_tms->evt_handler(p_tms, BLE_TMS_EVT_NOTIF_QUAT, p_evt_write->data, p_evt_write->len);
            }
        }
    }
    else if ( (p_evt_write->handle == p_tms->info_handles.cccd_handle) &&
         (p_evt_write->len == 2) )
    {
        bool notif_enabled;

        notif_enabled = ble_srv_is_notification_enabled(p_evt_write->data);

        if (p_tms->is_info_notif_enabled != notif_enabled)
        {
            p_tms->is_info_notif_enabled = notif_enabled;

            if (p_tms->evt_handler != NULL)
            {
                p_tms->evt_handler(p_tms, BLE_TMS_EVT_NOTIF_INFO, p_evt_write->data, p_evt_write->len);
            }
        }
    }
    else if ( (p_evt_write->handle == p_tms->raw_handles.cccd_handle) &&
         (p_evt_write->len == 2) )
    {
        bool notif_enabled;

        notif_enabled = ble_srv_is_notification_enabled(p_evt_write->data);

        if (p_tms->is_raw_notif_enabled != notif_enabled)
        {
            p_tms->is_raw_notif_enabled = notif_enabled;

            if (p_tms->evt_handler != NULL)
            {
                p_tms->evt_handler(p_tms, BLE_TMS_EVT_NOTIF_RAW, p_evt_write->data, p_evt_write->len);
            }
        }
    }
    else if ( (p_evt_write->handle == p_tms->euler_handles.cccd_handle) &&
         (p_evt_write->len == 2) )
    {
        bool notif_enabled;

        notif_enabled = ble_srv_is_notification_enabled(p_evt_write->data);

        if (p_tms->is_euler_notif_enabled != notif_enabled)
        {
            p_tms->is_euler_notif_enabled = notif_enabled;

            if (p_tms->evt_handler != NULL)
            {
                p_tms->evt_handler(p_tms, BLE_TMS_EVT_NOTIF_EULER, p_evt_write->data, p_evt_write->len);
            }
        }
    }
    else
    {
        // Do Nothing. This event is not relevant for this service.
    }
}


static void on_authorize_req(ble_tms_t * p_tms, ble_evt_t * p_ble_evt)
{
    ble_gatts_evt_rw_authorize_request_t * p_evt_rw_authorize_request = &p_ble_evt->evt.gatts_evt.params.authorize_request;
    ret_code_t err_code;

    if (p_evt_rw_authorize_request->type  == BLE_GATTS_AUTHORIZE_TYPE_WRITE)
    {
        NRF_LOG_DEBUG("BLE_GATTS_AUTHORIZE_TYPE_WRITE");

